[
  {
    "id": "peringatan-isra-miraj-2025",
    "title": "Peringatan Isra' Mi'raj 1446 H di Pondok Ngruki",
    "content": "Acara peringatan Isra' Mi'raj di Pondok Pesantren Islam Al Mukmin Ngruki berlangsung khidmat dengan diisi oleh tausiyah dari Ustadz...",
    "fullContent": "Acara peringatan Isra' Mi'raj 1446 H di Pondok Pesantren Islam Al Mukmin Ngruki berlangsung dengan sangat khidmat. Seluruh santri dan asatidz berkumpul di masjid utama untuk mendengarkan tausiyah inspiratif dari Ustadz terkemuka. Kegiatan ini bertujuan untuk meneladani perjalanan agung Nabi Muhammad SAW dan memperkuat keimanan para santri.",
    "image": "assets/images/adinaya.webp",
    "date": "27 Januari 2025"
  },
  {
    "id": "ist-festival-sukses-digelar",
    "title": "IST Festival 2024 Sukses Digelar dengan Meriah",
    "content": "IST Festival tahunan kembali digelar dengan sukses, menghadirkan berbagai lomba, bazar, dan malam puncak yang inspiratif...",
    "fullContent": "IST Festival, acara tahunan yang paling ditunggu, telah sukses diselenggarakan. Rangkaian acara dimulai dengan IST Competition yang diikuti oleh puluhan sekolah dasar, dilanjutkan dengan IST Food Fair yang ramai dikunjungi, dan ditutup dengan IST Night yang menghadirkan pembicara nasional. Acara ini menjadi bukti nyata kreativitas dan semangat organisasi para santri.",
    "image": "assets/images/adinaya.webp",
    "date": "15 Desember 2024"
  },
  {
    "id": "pelantikan-pengurus-baru",
    "title": "Pelantikan Pengurus Baru IST Periode Adinaya",
    "content": "Pengurus baru Imaarotu Syu’unith Tholabah (IST) periode Adinaya resmi dilantik dalam sebuah upacara yang sakral...",
    "fullContent": "Upacara pelantikan pengurus baru IST periode Adinaya telah dilaksanakan. Dalam acara ini, kepengurusan lama menyerahkan amanah kepada generasi penerus untuk melanjutkan roda organisasi. Diharapkan pengurus baru dapat membawa inovasi dan semangat baru untuk kemajuan kegiatan santri di Pondok Ngruki.",
    "image": "assets/images/adinaya.webp",
    "date": "10 Agustus 2024"
  }
]